system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

vertices
(
    // Front plane (z = -0.005 m)
    (0.0  -0.10 -0.005)   // 0: bottom bed upstream
    (1.0  -0.10 -0.005)   // 1: bottom bed contraction inlet
    (1.15 -0.10 -0.005)   // 2: bottom bed contraction outlet
    (8.0  -0.10 -0.005)   // 3: bottom bed downstream
    
    (0.0   0.0  -0.005)   // 4: interface upstream
    (1.0   0.0  -0.005)   // 5: interface contraction inlet
    (1.15  0.0  -0.005)   // 6: interface contraction outlet
    (8.0   0.0  -0.005)   // 7: interface downstream
    
    (0.0   0.075 -0.005)  // 8: soffit level upstream
    (1.0   0.075 -0.005)  // 9: soffit level contraction inlet
    (1.15  0.075 -0.005)  // 10: soffit level contraction outlet
    (8.0   0.075 -0.005)  // 11: soffit level downstream
    
    (0.0   0.10  -0.005)  // 12: top upstream
    (1.0   0.10  -0.005)  // 13: top contraction inlet outer
    (1.15  0.10  -0.005)  // 14: top contraction outlet outer
    (8.0   0.10  -0.005)  // 15: top downstream

    // Back plane (z = 0.005 m)
    (0.0  -0.10  0.005)   // 16: bottom bed upstream
    (1.0  -0.10  0.005)   // 17: bottom bed contraction inlet
    (1.15 -0.10  0.005)   // 18: bottom bed contraction outlet
    (8.0  -0.10  0.005)   // 19: bottom bed downstream
    
    (0.0   0.0   0.005)   // 20: interface upstream
    (1.0   0.0   0.005)   // 21: interface contraction inlet
    (1.15  0.0   0.005)   // 22: interface contraction outlet
    (8.0   0.0   0.005)   // 23: interface downstream
    
    (0.0   0.075  0.005)  // 24: soffit level upstream
    (1.0   0.075  0.005)  // 25: soffit level contraction inlet
    (1.15  0.075  0.005)  // 26: soffit level contraction outlet
    (8.0   0.075  0.005)  // 27: soffit level downstream
    
    (0.0   0.10   0.005)  // 28: top upstream
    (1.0   0.10   0.005)  // 29: top contraction inlet outer
    (1.15  0.10   0.005)  // 30: top contraction outlet outer
    (8.0   0.10   0.005)  // 31: top downstream
);

blocks
(
    // Bottom Layer: Sediment Bed (y: -0.10 to 0.0 m)
    hex (0 1 5 4 16 17 21 20) (120 40 1) simpleGrading (1 4 1)
    hex (1 2 6 5 17 18 22 21) (45  40 1) simpleGrading (1 4 1)
    hex (2 3 7 6 18 19 23 22) (800 40 1) simpleGrading (1 4 1)

    // Middle Layer: Lower Fluid/Water (y: 0.0 to 0.075 m)
    hex (4 5 9 8 20 21 25 24) (120 60 1) simpleGrading (1 0.05 1)
    hex (5 6 10 9 21 22 26 25) (45  60 1) simpleGrading (1 0.05 1)
    hex (6 7 11 10 22 23 27 26) (800 60 1) simpleGrading (1 0.05 1)

    // Top Layer: Upper Fluid/Water (y: 0.075 to 0.10 m)
    hex (8 9 13 12 24 25 29 28) (120 15 1) simpleGrading (1 0.25 1)
    hex (10 11 15 14 26 27 31 30) (800 15 1) simpleGrading (1 4 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 20 16)   // sediment bed inlet
            (4 8 24 20)   // lower fluid inlet
            (8 12 28 24)  // upper fluid inlet
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 19 23 7)   // sediment bed outlet
            (7 11 27 23)  // lower fluid outlet
            (11 15 31 27) // upper fluid outlet
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 16 17 1)
            (1 17 18 2)
            (2 18 19 3)
        );
    }
    top
    {
        type patch;
        faces
        (
            (12 13 29 28)
            (14 15 31 30)
        );
    }
    bridge
    {
        type wall;
        faces
        (
            (9 13 29 25)   // bridge vertical entry step (x = 1.0 m)
            (9 10 26 25)   // bridge soffit ceiling (y = 0.075 m)
            (10 14 30 26)  // bridge vertical exit step (x = 1.15 m)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // Front plane faces (z = -0.005 m, normal in -z direction)
            (0 4 5 1)
            (1 5 6 2)
            (2 6 7 3)
            (4 8 9 5)
            (5 9 10 6)
            (6 10 11 7)
            (8 12 13 9)
            (10 14 15 11)
            // Back plane faces (z = 0.005 m, normal in +z direction)
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (20 21 25 24)
            (21 22 26 25)
            (22 23 27 26)
            (24 25 29 28)
            (26 27 31 30)
        );
    }
);

mergePatchPairs
(
);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
